# Pandas

In [29]:
import pandas as pd

In [30]:
s = pd.Series([10,20,30,40])

In [31]:
print(s)

0    10
1    20
2    30
3    40
dtype: int64

In [32]:
print(s[0])

10

In [33]:
s = pd.Series([10,20,30],index = ["a","b","c"])

In [34]:
print(s)

a    10
b    20
c    30
dtype: int64

# Series from dictionary

In [35]:
data = {"Math": 90,"Physics": 85,"Chemistry": 88}

In [36]:
marks = pd.Series(data)

In [37]:
print(data)

{'Math': 90, 'Physics': 85, 'Chemistry': 88}

In [38]:
data = {
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [25, 30, 35],
    "Marks": [85, 90, 95]
}
print(data) #python dictionary
print(type(data))
#convert to pandas dataframe
marks = pd.DataFrame(data) #pandas automatically adds a default index starting from 0 by default. this is called RangeIndex

print(marks)

{'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25, 30, 35], 'Marks': [85, 90, 95]}
<class 'dict'>
      Name  Age  Marks
0    Alice   25     85
1      Bob   30     90
2  Charlie   35     95

In [40]:
df = pd.DataFrame({
    "Name": ["Aman", "Saurav","Karan"],
    "Age": [22,23,21],
    "Marks": [85,90,80]
})

In [41]:
df.head(2)

     Name  Age  Marks
0    Aman   22     85
1  Saurav   23     90

In [42]:
df.tail(2)

     Name  Age  Marks
1  Saurav   23     90
2   Karan   21     80

In [43]:
df.shape

(3, 3)

In [44]:
df.columns

Index(['Name', 'Age', 'Marks'], dtype='object')

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Marks   3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 204.0+ bytes

In [46]:
df.describe()

        Age  Marks
count   3.0    3.0
mean   22.0   85.0
std     1.0    5.0
min    21.0   80.0
25%    21.5   82.5
50%    22.0   85.0
75%    22.5   87.5
max    23.0   90.0

In [48]:
df[["Name" , "Marks"]]

     Name  Marks
0    Aman     85
1  Saurav     90
2   Karan     80

# Filtering in pandas

In [50]:
#multiple condition
df[(df["Age"]>21) & (df["Marks"]>85)]

     Name  Age  Marks
1  Saurav   23     90

In [51]:
df.sort_values("Marks")

     Name  Age  Marks
2   Karan   21     80
0    Aman   22     85
1  Saurav   23     90

# Sorting + Value count

In [52]:
df.sort_values("Marks",ascending = False)

     Name  Age  Marks
1  Saurav   23     90
0    Aman   22     85
2   Karan   21     80

In [54]:
df["Age"].value_counts()

Age
22    1
23    1
21    1
Name: count, dtype: int64

# Handling missing values

In [57]:
df = pd.DataFrame({
    "Name": ["Aman","Sourav","Karan","shubham",None,"sameer"],
    "Age": [22,23,None,22,25,25],
    "Marks": [85,None,88,90,56,None]

})

In [58]:
df.isnull()

    Name    Age  Marks
0  False  False  False
1  False  False   True
2  False   True  False
3  False  False  False
4   True  False  False
5  False  False   True

In [59]:
df.isnull().sum()

Name     1
Age      1
Marks    2
dtype: int64

In [60]:
cleaned_data=df.dropna()

In [61]:
cleaned_data

      Name   Age  Marks
0     Aman  22.0   85.0
3  shubham  22.0   90.0